In [75]:
import pandas as pd

In [76]:
people = {
          "First":["keshav","rahul","rajesh","shivam"],
          "Last":['sharma','varma','kushawah','pratap singh'],
          "Email":['keshav4118@gmail.com','rahulsharma81.rs@gmail.com','kesh99072@gmail.com',5]
}

In [77]:
data = pd.DataFrame(people)

In [78]:
data

    First          Last                       Email
0  keshav        sharma        keshav4118@gmail.com
1   rahul         varma  rahulsharma81.rs@gmail.com
2  rajesh      kushawah         kesh99072@gmail.com
3  shivam  pratap singh                           5

In [79]:
data.set_index("Email")
# This is not parmanent this is temporary

                             First          Last
Email
keshav4118@gmail.com        keshav        sharma
rahulsharma81.rs@gmail.com   rahul         varma
kesh99072@gmail.com         rajesh      kushawah
5                           shivam  pratap singh

In [80]:
data

    First          Last                       Email
0  keshav        sharma        keshav4118@gmail.com
1   rahul         varma  rahulsharma81.rs@gmail.com
2  rajesh      kushawah         kesh99072@gmail.com
3  shivam  pratap singh                           5

In [88]:
data.set_index("Email",inplace=True)
#When we use "inplace=True" then that index will parmanent

In [82]:
data

                             First          Last
Email
keshav4118@gmail.com        keshav        sharma
rahulsharma81.rs@gmail.com   rahul         varma
kesh99072@gmail.com         rajesh      kushawah
5                           shivam  pratap singh

In [83]:
data.loc['keshav4118@gmail.com']

First    keshav
Last     sharma
Name: keshav4118@gmail.com, dtype: object

In [84]:
#######                  data.loc[0]                                 ########
#we can't use integer bacause we changed index and we also using loc function, 
#instead of using loc function we can use "iloc" function for integer index.

data.iloc[0]

First    keshav
Last     sharma
Name: keshav4118@gmail.com, dtype: object

In [85]:
data.index

Index(['keshav4118@gmail.com', 'rahulsharma81.rs@gmail.com',
       'kesh99072@gmail.com', 5],
      dtype='object', name='Email')

In [86]:
data.reset_index(inplace=True)
# This mathod use to Reset Index

In [87]:
data

                        Email   First          Last
0        keshav4118@gmail.com  keshav        sharma
1  rahulsharma81.rs@gmail.com   rahul         varma
2         kesh99072@gmail.com  rajesh      kushawah
3                           5  shivam  pratap singh